finans.УчётИнвестиций/src/AccumulationRegisters/Инвест_Вклады/Инвест_Вклады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Инвест_Вклады</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вклад</name>
    <type>
      <types>CatalogRef.Инвест_Вклады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

finans.УчётИнвестиций/src/Documents/Инвест_ОткрытиеВклада/Инвест_ОткрытиеВклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Инвест_ОткрытиеВклада</name>
  <registerRecords>AccumulationRegister.Инвест_Вклады</registerRecords>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.Инвест_Банки</types>
    </type>
  </attributes>
  <attributes>
    <name>Вклад</name>
    <type>
      <types>CatalogRef.Инвест_Вклады</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

finans.УчётИнвестиций/src/CommonModules/Инвест_РаботаСВкладамиСервер/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюСуммуВклада(ДатаАктуальности, Вклад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Вклад", Вклад);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВкладыОстатки.Вклад КАК Вклад,
	|	ВкладыОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Инвест_Вклады.Остатки(&ДатаАктуальности, Вклад.КапитализацияПроцентов
	|	И НАЧАЛОПЕРИОДА(Вклад.ДатаОткрытияВклада, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И КОНЕЦПЕРИОДА(Вклад.ДатаЗакрытияВклада, МЕСЯЦ) >= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И Вклад = &Вклад) КАК ВкладыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВкладыОбороты.Вклад,
	|	ВкладыОбороты.СуммаПриход
	|ИЗ
	|	РегистрНакопления.Инвест_Вклады.Обороты(, &ДатаАктуальности, Регистратор,
	|	НЕ Вклад.КапитализацияПроцентов
	|	И НАЧАЛОПЕРИОДА(Вклад.ДатаОткрытияВклада, МЕСЯЦ) <= НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И КОНЕЦПЕРИОДА(Вклад.ДатаЗакрытияВклада, МЕСЯЦ) >= КОНЕЦПЕРИОДА(&ДатаАктуальности, МЕСЯЦ)
	|	И Вклад = &Вклад) КАК ВкладыОбороты
	|ГДЕ
	|	ВкладыОбороты.Регистратор ССЫЛКА Документ.Инвест_ОткрытиеВклада";
	Возврат Запрос.Выполнить().Выгрузить().Итог("Сумма");
	
КонецФункции

#КонецОбласти
